###############################################################################
# Created by write_sdc
# Fri Dec  9 08:38:02 2022
###############################################################################
current_design processor
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 40.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Serial_input}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[0]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[10]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[11]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[12]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[13]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[14]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[15]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[1]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[2]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[3]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[4]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[5]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[6]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[7]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[8]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[9]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[0]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[10]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[11]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[12]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[13]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[14]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[15]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[1]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[2]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[3]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[4]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[5]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[6]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[7]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[8]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[9]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reset}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {start}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Dataw_en}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Serial_output}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_mem_addr[0]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_mem_addr[1]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_mem_addr[2]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_mem_addr[3]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_mem_addr[4]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_mem_addr[5]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_mem_addr[6]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_mem_addr[7]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {hlt}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr_mem_addr[0]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr_mem_addr[10]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr_mem_addr[11]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr_mem_addr[12]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr_mem_addr[1]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr_mem_addr[2]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr_mem_addr[3]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr_mem_addr[4]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr_mem_addr[5]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr_mem_addr[6]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr_mem_addr[7]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr_mem_addr[8]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr_mem_addr[9]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_data[0]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_data[10]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_data[11]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_data[12]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_data[13]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_data[14]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_data[15]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_data[1]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_data[2]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_data[3]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_data[4]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_data[5]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_data[6]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_data[7]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_data[8]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_data[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0729 [get_ports {Dataw_en}]
set_load -pin_load 0.0729 [get_ports {Serial_output}]
set_load -pin_load 0.0729 [get_ports {hlt}]
set_load -pin_load 0.0729 [get_ports {data_mem_addr[7]}]
set_load -pin_load 0.0729 [get_ports {data_mem_addr[6]}]
set_load -pin_load 0.0729 [get_ports {data_mem_addr[5]}]
set_load -pin_load 0.0729 [get_ports {data_mem_addr[4]}]
set_load -pin_load 0.0729 [get_ports {data_mem_addr[3]}]
set_load -pin_load 0.0729 [get_ports {data_mem_addr[2]}]
set_load -pin_load 0.0729 [get_ports {data_mem_addr[1]}]
set_load -pin_load 0.0729 [get_ports {data_mem_addr[0]}]
set_load -pin_load 0.0729 [get_ports {instr_mem_addr[12]}]
set_load -pin_load 0.0729 [get_ports {instr_mem_addr[11]}]
set_load -pin_load 0.0729 [get_ports {instr_mem_addr[10]}]
set_load -pin_load 0.0729 [get_ports {instr_mem_addr[9]}]
set_load -pin_load 0.0729 [get_ports {instr_mem_addr[8]}]
set_load -pin_load 0.0729 [get_ports {instr_mem_addr[7]}]
set_load -pin_load 0.0729 [get_ports {instr_mem_addr[6]}]
set_load -pin_load 0.0729 [get_ports {instr_mem_addr[5]}]
set_load -pin_load 0.0729 [get_ports {instr_mem_addr[4]}]
set_load -pin_load 0.0729 [get_ports {instr_mem_addr[3]}]
set_load -pin_load 0.0729 [get_ports {instr_mem_addr[2]}]
set_load -pin_load 0.0729 [get_ports {instr_mem_addr[1]}]
set_load -pin_load 0.0729 [get_ports {instr_mem_addr[0]}]
set_load -pin_load 0.0729 [get_ports {write_data[15]}]
set_load -pin_load 0.0729 [get_ports {write_data[14]}]
set_load -pin_load 0.0729 [get_ports {write_data[13]}]
set_load -pin_load 0.0729 [get_ports {write_data[12]}]
set_load -pin_load 0.0729 [get_ports {write_data[11]}]
set_load -pin_load 0.0729 [get_ports {write_data[10]}]
set_load -pin_load 0.0729 [get_ports {write_data[9]}]
set_load -pin_load 0.0729 [get_ports {write_data[8]}]
set_load -pin_load 0.0729 [get_ports {write_data[7]}]
set_load -pin_load 0.0729 [get_ports {write_data[6]}]
set_load -pin_load 0.0729 [get_ports {write_data[5]}]
set_load -pin_load 0.0729 [get_ports {write_data[4]}]
set_load -pin_load 0.0729 [get_ports {write_data[3]}]
set_load -pin_load 0.0729 [get_ports {write_data[2]}]
set_load -pin_load 0.0729 [get_ports {write_data[1]}]
set_load -pin_load 0.0729 [get_ports {write_data[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Serial_input}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_4 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reset}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {start}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[15]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[14]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[13]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[12]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[11]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[10]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[9]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[8]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[7]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[6]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[15]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[14]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[13]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[12]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[11]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[10]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[9]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[8]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[7]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[6]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 4.0000 [current_design]
